       IDENTIFICATION DIVISION.
       PROGRAM-ID. BASIC_03.
       
       DATA DIVISION.
       	WORKING-STORAGE SECTION.
       		01 WS-NUM1 PIC 9(6) VALUE 10.
       		01 WS-NUM2 PIC 9(6) VALUE 10.
       		01 WS-NUM3 PIC 9(6) VALUE 10.
       		01 WS-NUM4 PIC 9(6) VALUE 10.
       
       PROCEDURE DIVISION.
       	ADD WS-NUM1 WS-NUM2 TO WS-NUM3 WS-NUM4.
       	DISPLAY "WS-NUM3 : ", WS-NUM3.
       	DISPLAY "WS-NUM4 : ", WS-NUM4.
       STOP RUN.